n = int(input())

def number_to_words(n):
    units = ['', 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    teens = ['десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать','пятнадцать',
             'шестнадцать','семнадцать','восемнадцать','девятнадцать']
    tens = ['', '', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    hundreds = ['', 'сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот', 'девятьсот']

    if n == 0:
        return 'ноль'
    words = []
    if n >= 100:
        words.append(hundreds[n//100])
        n = n % 100
    if 10 <= n < 20:
        words.append(teens[n-10])
    else:
        if n >= 20:
            words.append(tens[n//10])
            n = n % 10
        if n > 0:
            words.append(units[n])
    return ' '.join([w for w in words if w])

print(number_to_words(n))
