masses = [12, 15, 8, 20, 10, 14, 9, 11, 13, 16, 7, 18, 10, 14, 12, 19, 13, 17, 16, 9, 8, 15, 11, 13, 12, 10, 14, 15, 9]
volumes = [3, 5, 2, 4, 3, 3, 2, 3, 4, 5, 2, 6, 3, 4, 3, 7, 4, 6, 5, 2, 2, 5, 3, 4, 3, 3, 4, 5, 2]
materials = ['Дерево', 'Металл', 'Пластик', 'Керамика', 'Сталь', 'Алюминий', 'Бетон', 'Медь', 'Стекло', 'Латунь',
             'Глина', 'Мрамор', 'Кремний', 'Титан', 'Бронза', 'Дюралюминий', 'Железо', 'Листовая сталь',
             'Айсберг', 'Древесина', 'Бетон', 'Бронза', 'Кремний', 'Графит', 'Керамика', 'Медь', 'Пластик', 'Сталь']
densities = [m / v for m, v in zip(masses, volumes)]
min_density_index = densities.index(min(densities))
print('Материал с минимальной плотностью:', materials[min_density_index])
